app/controllers/popups_controller.rb

def index
  @popups = Popup.all
---
SELECT "popups".* FROM "popups"

def new
  @popup = Popup.new
  @popups = Popup.all
---
SELECT "popups".* FROM "popups"

def create
  @popup = Popup.new popup_params
  if @popup.save
---
INSERT INTO "popups" ("address", "created_at", "description", "expires_at", "hours", "image", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

def show
  @popup = Popup.find_by_id(params[:id])
---
SELECT  "popups".* FROM "popups"  WHERE "popups"."id" = 1 LIMIT 1