app/views/popups/show.html.erb

                  <h7>Posted <%= time_ago_in_words(feed.created_at) %> ago by: </h7><br>
                  <h7 ><strong><%= feed.user.email %></strong></h7></br><!-- User.where(id: feed.user_id).first.email  -->
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1